cypress/pdl/devices/psoc6/svd/psoc61.svd
Note that this register is constant '1'; i.e. privileged read accesses are ALWAYS allowed.</description>
                <bitRange>[3:3]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>PW</name>
                <description>See corresponding field for PPU structure with programmable address.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PX</name>
                <description>See corresponding field for PPU structure with programmable address.

Note that this register is constant '0'; i.e. privileged execute accesses are NEVER allowed.</description>
                <bitRange>[5:5]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>NS</name>
                <description>See corresponding field for PPU structure with programmable address.</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PC_MASK_0</name>
                <description>See corresponding field for PPU structure with programmable address.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>PC_MASK_15_TO_1</name>
                <description>See corresponding field for PPU structure with programmable address.</description>
                <bitRange>[23:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>REGION_SIZE</name>
                <description>See corresponding field for PPU structure with programmable address.

'7': 256 B region</description>
                <bitRange>[28:24]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>PC_MATCH</name>
                <description>See corresponding field for PPU structure with programmable address.</description>
                <bitRange>[30:30]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLED</name>
                <description>See corresponding field for PPU structure with programmable address.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>11</dim>
          <dimIncrement>64</dimIncrement>
          <name>PPU_GR[%s]</name>
          <description>PPU structure with fixed/constant address for a peripheral group</description>
          <addressOffset>0x00005000</addressOffset>
          <register>
            <name>ADDR0</name>
            <description>PPU region address 0 (slave structure)</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SUBREGION_DISABLE</name>
                <description>See corresponding field for PPU structure with programmable address.

Note: this field is read-only. Its value is chip specific.</description>
                <bitRange>[7:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>ADDR24</name>
                <description>See corresponding field for PPU structure with programmable address.

'ADDR_DEF1': address of protected region.

Note: this field is read-only. Its value is chip specific.</description>
                <bitRange>[31:8]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ATT0</name>
            <description>PPU region attributes 0 (slave structure)</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x124</resetValue>
            <resetMask>0x9F000124</resetMask>
            <fields>
              <field>
                <name>UR</name>
                <description>See corresponding field for PPU structure with programmable address.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>UW</name>
                <description>See corresponding field for PPU structure with programmable address.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>UX</name>
                <description>See corresponding field for PPU structure with programmable address.

Note that this register is constant '1'; i.e. user execute accesses are ALWAYS allowed.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>PR</name>
                <description>See corresponding field for PPU structure with programmable address.</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PW</name>
                <description>See corresponding field for PPU structure with programmable address.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PX</name>
                <description>See corresponding field for PPU structure with programmable address.

Note that this register is constant '1'; i.e. user execute accesses are ALWAYS allowed.</description>
                <bitRange>[5:5]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>NS</name>
                <description>See corresponding field for PPU structure with programmable address.</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PC_MASK_0</name>
                <description>See corresponding field for PPU structure with programmable address.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>PC_MASK_15_TO_1</name>
                <description>See corresponding field for PPU structure with programmable address.</description>
                <bitRange>[23:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>REGION_SIZE</name>
                <description>See corresponding field for PPU structure with programmable address.

Note: this field is read-only. Its value is chip specific.</description>
                <bitRange>[28:24]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>PC_MATCH</name>
                <description>See corresponding field for PPU structure with programmable address.</description>
                <bitRange>[30:30]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLED</name>
                <description>See corresponding field for PPU structure with programmable address.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADDR1</name>
            <description>PPU region address 1 (master structure)</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SUBREGION_DISABLE</name>
                <description>See corresponding field for PPU structure with programmable address.

Two out of a total of eight 32 B subregions are enabled. These subregions includes region structures 0 and 1. 

Note: this field is read-only.</description>
                <bitRange>[7:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>ADDR24</name>
                <description>See corresponding field for PPU structure with programmable address.

'ADDR_DEF1': base address of structure.

Note: this field is read-only.</description>
                <bitRange>[31:8]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ATT1</name>
            <description>PPU region attributes 1 (master structure)</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x7000109</resetValue>
            <resetMask>0x9F00012D</resetMask>
            <fields>
              <field>
                <name>UR</name>
                <description>See corresponding field for PPU structure with programmable address.

Note that this register is constant '1'; i.e. user read accesses are ALWAYS allowed.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>UW</name>
                <description>See corresponding field for PPU structure with programmable address.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>UX</name>
                <description>See corresponding field for PPU structure with programmable address.

Note that this register is constant '0'; i.e. user execute accesses are NEVER allowed.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>PR</name>
                <description>See corresponding field for PPU structure with programmable address.

