cypress/pdl/devices/psoc6/svd/psoc61.svd
(Note: These bits are connected to AR36U12.PDM_CORE2_CFG.PCM_CHSET)</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Channel disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MONO_L</name>
                  <description>Mono left channel enable</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MONO_R</name>
                  <description>Mono right channel enable</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STEREO</name>
                  <description>Stereo channel enable</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWAP_LR</name>
              <description>Input data L/R channel swap:
'1': Right/Left channel recording swap
'0': No Swap
(Note: This bit is connected to AR36U12.PDM_CORE_CFG.LRSWAP)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>S_CYCLES</name>
              <description>Set time step for gain change during PGA or soft mute operation in
number of 1/a sampling rate.
(Note: These bits are connected to AR36U12.PDM_CORE_CFG.S_CYCLES)</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STEP_NUM64</name>
                  <description>64steps</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STEP_NUM96</name>
                  <description>96steps</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STEP_NUM128</name>
                  <description>128steps</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STEP_NUM160</name>
                  <description>160steps</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STEP_NUM192</name>
                  <description>192steps</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STEP_NUM256</name>
                  <description>256steps</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STEP_NUM384</name>
                  <description>384steps</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STEP_NUM512</name>
                  <description>512steps</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKO_DELAY</name>
              <description>Phase difference from the rising edge of internal sampler clock (CLK_IS) to that of PDM_CKO clock:

(Note: These bits are connected to AR36U12.PDM_CORE2_CFG.PDMCKO_DLY)</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADV3</name>
                  <description>CLK_IS is 3*PDM_CLK period early</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADV2</name>
                  <description>CLK_IS is 2*PDM_CLK period early</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADV1</name>
                  <description>CLK_IS is 1*PDM_CLK period early</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_DELAY</name>
                  <description>CLK_IS is the same as PDM_CKO</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY1</name>
                  <description>CLK_IS is 1*PDM_CLK period late</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY2</name>
                  <description>CLK_IS is 2*PDM_CLK period late</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY3</name>
                  <description>CLK_IS is 3*PDM_CLK period late</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY4</name>
                  <description>CLK_IS is 4*PDM_CLK period late</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPF_GAIN</name>
              <description>Adjust high pass filter coefficients. 
H(Z) = (1 - Z-1 ) / [1 - (1- 2 -HPF_GAIN) Z-1 ]
(Note: These bits are connected to AR36U12.PDM_CORE_CFG.HPGAIN)</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HPF_EN_N</name>
              <description>Enable high pass filter (active low)
'1': Disabled.
'0': Enabled.
(Note: This bit is connected to AR36U12.PDM_CORE_CFG.ADCHPD)</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_CTL</name>
          <description>Data control</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x103</resetMask>
          <fields>
            <field>
              <name>WORD_LEN</name>
              <description>PCM Word Length in number of bits:

